{
    "architectures": [
        "MistralForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "torch_dtype": "float16",
    "eos_token_id": 32000,
    "head_dim": 96,
    "hidden_act": "silu",
    "hidden_size": 3072,
    "initializer_range": 0.02,
    "intermediate_size": 8192,
    "max_position_embeddings": 4096,
    "model_type": "mistral",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 32,
    "pad_token_id": 32009,
    "rms_norm_eps": 1e-05,
    "rope_parameters": {
        "rope_theta": 10000.0,
        "rope_type": "default"
    },
    "sliding_window": 2048,
    "tie_word_embeddings": false,
    "unsloth_version": "2026.3.3",
    "use_cache": false,
    "vocab_size": 32064
}