{
  "add_prefix_space": null,
  "backend": "tokenizers",
  "bos_token": "<s>",
  "clean_up_tokenization_spaces": false,
  "eos_token": "<|endoftext|>",
  "is_local": false,
  "legacy": false,
  "model_max_length": 4096,
  "pad_token": "<|placeholder6|>",
  "padding_side": "left",
  "sp_model_kwargs": {},
  "tokenizer_class": "TokenizersBackend",
  "unk_token": "<unk>",
  "use_default_system_prompt": false,
  "chat_template": "{% for message in messages %}{% if message['role'] == 'system' %}{{'<|system|>\n' + message['content'] + '<|end|>\n'}}{% elif message['role'] == 'user' %}{{'<|user|>\n' + message['content'] + '<|end|>\n'}}{% elif message['role'] == 'assistant' %}{{'<|assistant|>\n' + message['content'] + '<|end|>\n'}}{% endif %}{% endfor %}{% if add_generation_prompt %}{{ '<|assistant|>\n' }}{% else %}{{ eos_token }}{% endif %}"
}